Repository: maksimyugov89/FuelMaster
Catalog: lib/l10n/app_*.arb
Languages: ru

# welcome_message
source: Welcome to Fuel Master!
ru: Добро пожаловать в Fuel Master!

source: Go to History
ru: Перейти к истории

# history_title
source: Calculation History
ru: История расчетов

# select_car
source: Select a car
ru: Выбрать автомобиль

source: All Cars
ru: Все автомобили

source: Fuel Usage Chart
ru: График расхода топлива

source: No Chart Data
ru: Нет данных для графика

source: History Calculations
ru: История расчетов

# history_empty
source: History is Empty
ru: История пуста

# no_history_for_car
source: No Records for Selected Car
ru: Нет записей для выбранного автомобиля

source: Export Record
ru: Экспортировать запись

# export_email
source: Export via Email
ru: Экспортировать через Email

# export_telegram
source: Export via Telegram
ru: Экспортировать через Telegram

# export_whatsapp
source: Export via WhatsApp
ru: Экспортировать через WhatsApp

source: Clear History
ru: Очистить историю

# clear_history_confirm
source: Are you sure you want to clear the calculation history?
ru: Вы уверены, что хотите очистить историю расчетов?

source: Cancel
ru: Отмена

source: Clear
ru: Очистить

source: History Cleared
ru: История очищена

# history_empty_export
source: History is Empty
ru: История пуста

# fuel_history_message
source: Fuel Calculation History
ru: История расчетов топлива

# email_subject
source: Fuel History
ru: История топлива

# error
source: An error occurred
ru: Произошла ошибка

# error_email
source: Unable to open email client
ru: Не удалось открыть почтовый клиент

# error_telegram
source: Unable to open Telegram
ru: Не удалось открыть Telegram

# error_whatsapp
source: Unable to open WhatsApp
ru: Не удалось открыть WhatsApp

source: Other
ru: Другое

source: Share History
ru: Поделиться историей

# select_share_method
source: Select a method to share the history
ru: Выберите способ отправки истории

# invalid_input
source: Invalid input format
ru: Неверный формат данных

# out_of_range
source: Values out of range
ru: Значения вне допустимого диапазона

# final_mileage_greater
source: Final mileage must be greater than initial
ru: Конечный пробег должен быть больше начального

# highway_not_exceed_total
source: Highway mileage cannot exceed total mileage
ru: Пробег по трассе не должен превышать общий

source: Date
ru: Дата

source: Brand
ru: Марка

source: Model
ru: Модель

source: Initial Mileage
ru: Начальный пробег

source: Final Mileage
ru: Конечный пробег

source: Total Mileage
ru: Общий пробег

source: City Mileage
ru: Пробег по городу

source: City Norm
ru: Городская норма

source: Highway Mileage
ru: Пробег по трассе

source: Highway Norm
ru: Трассовая норма

source: Refuel
ru: Заправка

source: Fuel Used
ru: Расход

source: Final Fuel
ru: Остаток

# liters
source: L
ru: л

# kilometers
source: km
ru: км

# success
source: Calculation completed
ru: Расчет выполнен

source: Current Calculations
ru: Текущие расчеты

# no_calculations
source: No calculations available
ru: Нет доступных расчетов

# record_deleted
source: Record deleted successfully
ru: Запись успешно удалена

source: OK
ru: ОК

source: Back
ru: Назад

source: Logo not found
ru: Логотип не найден

# initial_mileage_short
source: Init. km
ru: Нач. км

# final_mileage_short
source: Final km
ru: Кон. км

# initial_fuel_short
source: Init. Fuel
ru: Нач. топл.

# refuel_short
source: Refuel
ru: Заправка

# highway_distance_short
source: Highway km
ru: Трасса км

source: Theme
ru: Тема

source: Light
ru: Светлая

source: Dark
ru: Темная

source: Auto
ru: Авто

# theme_changed
source: Theme changed to %s
ru: Тема изменена на %s

source: Language
ru: Язык

source: Russian
ru: Русский

source: English
ru: Английский

# language_changed
source: Language changed to %s
ru: Язык изменен на %s

# step1
source: Enter car details (brand, model, fuel norms).
ru: Введите данные автомобиля (марка, модель, нормы расхода).

# step2
source: Calculate fuel consumption by entering mileage and refueling data.
ru: Рассчитайте расход топлива, указав пробег и заправки.

# step3
source: View history and export data.
ru: Просмотрите историю и экспортируйте данные.

# step1_title
source: Add Your Car
ru: Добавьте свой автомобиль

# step1_description
source: Add your car's details, including make, model, and fuel consumption rates.
ru: Добавьте данные о своем автомобиле, включая марку, модель и нормы расхода топлива.

# step2_title
source: Calculate Fuel Consumption
ru: Рассчитывайте расход топлива

# step2_description
source: Use the calculator to track your fuel usage based on mileage and refueling.
ru: Используйте калькулятор для отслеживания расхода топлива на основе пробега и заправок.

# step3_title
source: Track Your History
ru: Отслеживайте свою историю

# step3_description
source: View your fuel consumption history, export data, and get insights.
ru: Просматривайте историю расхода топлива, экспортируйте данные и получайте статистику.

# start_app
source: Start Using
ru: Начать использование

source: Enter Car Details
ru: Введите данные автомобиля

source: Save and Continue
ru: Сохранить и продолжить

source: Next
ru: Далее

# previous_cars
source: Previously Added Cars
ru: Ранее введенные автомобили

# no_cars
source: No cars added
ru: Нет добавленных автомобилей

source: Delete Car
ru: Удалить автомобиль

# delete_car_confirm
source: Are you sure you want to delete this car?
ru: Вы уверены, что хотите удалить этот автомобиль?

# fill_all_fields
source: Please fill in all fields
ru: Заполните все поля

source: Delete
ru: Удалить

source: Settings
ru: Настройки

source: Home
ru: Главная

source: History
ru: История

# liters_per_100km
source: L/100km
ru: л/100км

source: Calculate
ru: Рассчитать

# save_and_back
source: Save
ru: Сохранить

# continue_calculations
source: Continue
ru: Продолжить

source: Your Cars
ru: Ваши автомобили

# car_saved
source: Car saved successfully
ru: Автомобиль успешно сохранён

source: Create New Car
ru: Создать новый автомобиль

# configure_cars
source: Configure Your Cars
ru: Настройка твоих авто

source: Select Period
ru: Выбрать период

source: Reset Period
ru: Сброс периода

source: Share All History
ru: Поделиться всей историей

source: Go to Calculator
ru: Перейти к калькулятору

source: Calculation Complete
ru: Расчёт завершён

# calculation_options
source: To continue, you can save the current calculation and return to the main menu or continue calculations in this window.
ru: Для продолжения вы можете сохранить текущий расчёт и вернуться в главное меню или продолжить расчёты в этом окне.

# duplicate_model
source: This model is already in use!
ru: Эта модель уже используется!

# invalid_norm
source: Invalid fuel norm format!
ru: Неверный формат нормы расхода!

# positive_norm
source: Fuel norm must be positive!
ru: Норма расхода должна быть положительной!

source: Loading...
ru: Загрузка...

# ad_not_available
source: Advertisement not available
ru: Реклама недоступна

source: Period
ru: Период

# ad_load_failed
source: Failed to load ad, please try again later
ru: Не удалось загрузить рекламу, попробуйте позже

# ad_show_failed
source: Failed to show ad, please try again
ru: Не удалось показать рекламу, попробуйте снова

source: Continue Calculation
ru: Продолжить расчёт

# choose_calculation_option
source: Do you want to start a new calculation or continue the current one?
ru: Хотите начать новый расчёт или продолжить текущий?

source: Start New Calculation
ru: Начать новый расчёт

source: Continue Current Calculation
ru: Продолжить текущий расчёт

source: New calculation started
ru: Начался новый расчёт

# continued_calculation
source: Continued current calculation
ru: Продолжен текущий расчёт

# no_previous_calculation
source: No previous calculations available
ru: Нет предыдущих расчётов

# negative_final_fuel
source: Previous final fuel is negative, please start a new calculation
ru: Остаток топлива из предыдущего расчёта отрицательный, начните новый расчёт

# confirm_save_before_exit
source: You have unsaved calculations. Save before exiting?
ru: У вас есть несохранённые расчёты. Сохранить перед выходом?

source: Generation
ru: Поколение

source: Modification
ru: Модификация

source: Year From
ru: Год начала выпуска

source: Year To
ru: Год окончания выпуска

source: Engine Volume
ru: Объём двигателя

source: Power (HP)
ru: Мощность (л.с.)

source: Fuel Type
ru: Тип топлива

source: Petrol
ru: Бензин

source: Diesel
ru: Дизель

source: LPG
ru: Сжиженный газ

source: CNG
ru: Компрессированный газ

source: Transmission Type
ru: Тип КПП

source: Transmission Speeds
ru: Количество передач

# combined_norm
source: Combined Fuel Consumption
ru: Смешанный расход топлива

source: Base City Norm
ru: Базовая норма по городу

source: Base Highway Norm
ru: Базовая норма по трассе

source: Base Combined Norm
ru: Базовая смешанная норма

source: City
ru: Город

source: Weather Multiplier
ru: Погодный коэффициент

# invalid_engine_volume
source: Engine volume must be between 0.5 and 10 liters
ru: Объём двигателя должен быть от 0.5 до 10 литров

source: Premium Subscription
ru: Премиум-подписка

source: Buy
ru: Купить

source: Premium Active
ru: Премиум активирован

# store_unavailable
source: Store is unavailable
ru: Магазин недоступен

# product_not_found
source: Premium product not found
ru: Премиум-продукт не найден

# premium_purchase_in_progress
source: Purchase in progress
ru: Покупка в процессе

source: Premium activated
ru: Премиум активирован

source: Purchase error
ru: Ошибка покупки

# weather_unavailable
source: Weather data unavailable, using default values
ru: Погодные данные недоступны, используются значения по умолчанию

# enter_city
source: Enter your city
ru: Введите ваш город

source: Register
ru: Регистрация

source: Email or Phone
ru: Email или телефон

source: Password
ru: Пароль

source: Detect Location
ru: Определить местоположение

# location_service_disabled
source: Location services are disabled
ru: Службы геолокации отключены

source: Location permission denied
ru: Разрешение на геолокацию отклонено

# location_permission_denied_forever
source: Location permission permanently denied
ru: Разрешение на геолокацию отклонено навсегда

# invalid_email_or_phone
source: Invalid email or phone number format
ru: Неверный формат email или номера телефона

# api_key_missing
source: Google API key is missing
ru: Ключ Google API отсутствует

source: Edit Car
ru: Редактировать автомобиль

source: Vehicle Type
ru: Тип транспортного средства

source: Select vehicle type
ru: Выберите тип транспортного средства

source: Passenger Car
ru: Легковой

source: Bus
ru: Автобус

source: Truck
ru: Грузовой бор. автомобиль

source: Tractor
ru: Тягач

source: Dump Truck
ru: Самосвал

source: Van
ru: Фургон

# vanWithoutCargo
source: Van without cargo (add 10% to norm)
ru: Фургон без учета груза (добавка 10% к норме)

# trailerMass
source: Trailer Mass (tonnes)
ru: Масса прицепа (т)

# payloadCapacity
source: Payload Capacity (tonnes)
ru: Грузоподъемность (т)

# tripFuelRate
source: Fuel Rate per Trip (liters)
ru: Норма расхода топлива на ездку (л)

# heaterRate
source: Heater Fuel Rate (liters/hour)
ru: Норма расхода топлива на отопитель (л/ч)

# heaterTime
source: Heater Operation Time (hours)
ru: Время работы отопителя (ч)

# mileage
source: Mileage (km)
ru: Пробег (км)

# cargoMass
source: Cargo Mass (tonnes)
ru: Масса груза (т)

# cargoMileage
source: Cargo Mileage (km)
ru: Пробег с грузом (км)

# trips
source: Number of Trips
ru: Количество ездок

source: Correction Factor (%)
ru: Поправочный коэффициент (%)

# autoCorrectionFactor
source: Use Automatic Correction Factor
ru: Использовать автоматический расчет коэффициента

# winterConditions
source: Winter Conditions (+10%)
ru: Зимние условия (+10%)

# mountainConditions
source: Mountain Conditions (+15%)
ru: Горная местность (+15%)

# airConditioner
source: Air Conditioner (+7%)
ru: Кондиционер (+7%)

source: Calculated Fuel Consumption
ru: Рассчитанный расход топлива

source: Electric
ru: Электро

source: Gas-Diesel
ru: Газодизель

source: Adjustments
ru: Корректировки

source: History Exported
ru: История экспортирована

source: Export
ru: Экспорт

# geocoding_error
source: Unable to fetch location
ru: Не удалось определить местоположение

# api_key_invalid
source: Invalid API key
ru: Недействительный ключ API

source: Winter
ru: Зима

# ac
source: Air Conditioner
ru: Кондиционер

# mountain
source: Mountain Terrain
ru: Горная местность

source: Vehicle Type
ru: Тип транспортного средства

source: Passenger Car
ru: Легковой автомобиль

source: Dump Truck
ru: Самосвал

source: Special Equipment
ru: Спецтехника

# select_preset_car
source: Select Predefined Car
ru: Выберите предустановленный автомобиль

source: Custom Input
ru: Ручной ввод

source: License Plate
ru: ГРЗ

# fill_license_plate
source: Please fill in the license plate
ru: Заполните ГРЗ

# duplicate_license_plate
source: License plate already in use
ru: ГРЗ уже используется

source: Search car
ru: Поиск автомобиля

source: Car deleted
ru: Автомобиль удалён

source: Select Brand
ru: Выберите марку

source: Select Model
ru: Выберите модель

source: Select Generation
ru: Выберите поколение

source: No data found
ru: Данные не найдены

source: No cars available
ru: Нет доступных автомобилей

# fuel_advice_button
source: AI Fuel Efficiency Advice
ru: AI совет по экономии

# fuel_advice_title
source: Fuel Efficiency Tips
ru: Советы по экономии топлива

# premium_feature
source: This feature is available only for premium users
ru: Эта функция доступна только для премиум-пользователей

source: Share
ru: Поделиться

# insufficient_balance
source: Insufficient balance for AI advice. Please top up your account.
ru: Недостаточно баланса для AI-советов. Пополните счёт.

# error_sharing
source: Error while trying to share advice
ru: Ошибка при попытке поделиться советом

# no_advice_to_share
source: No advice available to share
ru: Нет советов для отправки

source: Search
ru: Поиск

source: Correction Factor (%)
ru: Поправочный коэффициент (%)

# heater_operating_time
source: Heater Operating Time (h)
ru: Время работы отопителя (ч)

# invalid_correction_factor
source: Correction factor must be between -50 and 50%
ru: Поправочный коэффициент должен быть в диапазоне -50..50%

# invalid_heater_time
source: Heater operating time must be non-negative
ru: Время работы отопителя должно быть неотрицательным

source: Heater Fuel Consumption
ru: Расход топлива на отопитель

source: Passenger Capacity
ru: Пассажировместимость

# sync_success
source: Data synced successfully
ru: Данные успешно синхронизированы

# sync_error
source: Failed to sync data. Please try again.
ru: Не удалось синхронизировать данные. Попробуйте снова.

source: Log In
ru: Вход

source: Email
ru: Электронная почта

# invalid_email
source: Invalid email address
ru: Недействительный адрес электронной почты

# weak_password
source: Password must be at least 6 characters
ru: Пароль должен содержать не менее 6 символов

# registration_success
source: Registration successful
ru: Регистрация прошла успешно

source: Email already in use
ru: Электронная почта уже используется

# login_success
source: Login successful
ru: Вход выполнен успешно

# invalid_credentials
source: Invalid email or password
ru: Недействительный email или пароль

# register_instead
source: Don't have an account? Register
ru: Нет аккаунта? Зарегистрируйтесь

# login_instead
source: Already have an account? Log In
ru: Уже есть аккаунт? Войдите

source: Sign Out
ru: Выйти из аккаунта

# sign_out_success
source: Signed out successfully
ru: Выход выполнен успешно

source: Loading car database...
ru: Загрузка базы данных автотранспорта...

# duplicate_record
source: Calculation has already been saved.
ru: Расчет уже сохранен.

source: yes
ru: Да

source: no
ru: Нет

source: Unsaved Changes
ru: Несохраненные изменения

source: Save
ru: Сохранить

# history_label_date
source: Date
ru: Дата

# history_label_brand
source: Brand
ru: Марка

# history_label_license_plate
source: License Plate
ru: Гос. номер

# history_label_initial_mileage
source: Initial Mileage
ru: Начальный пробег

# history_label_final_mileage
source: Final Mileage
ru: Конечный пробег

# history_label_total_mileage
source: Total Mileage
ru: Общий пробег

# history_label_city_mileage
source: City Mileage
ru: Пробег по городу

# history_label_highway_mileage
source: Highway Mileage
ru: Пробег по трассе

# history_label_city_norm
source: City Norm
ru: Городская норма

# history_label_highway_norm
source: Highway Norm
ru: Трассовая норма

# history_label_initial_fuel
source: Initial Fuel
ru: Начальное топливо

# history_label_refuel
source: Refuel
ru: Заправка

# history_label_fuel_used
source: Fuel Used
ru: Расход

# history_label_final_fuel
source: Final Fuel
ru: Остаток

# condition_winter
source: Winter
ru: Зима

# condition_ac
source: A/C
ru: Кондиционер

# condition_mountain
source: Mountain
ru: Горная местность

# confirm_delete_record_title
source: Confirm Deletion
ru: Подтвердите удаление

# confirm_delete_record_content
source: Are you sure you want to delete this record?
ru: Вы уверены, что хотите удалить эту запись?

source: No modification
ru: Нет модификации

# correction_factor_tooltip
source: This factor adjusts the fuel consumption rate. Automatic Mode: When this option is enabled, the factor is calculated automatically based on current weather data (temperature, wind, precipitation). This allows for an accurate accounting of weather's impact on fuel consumption. Manual Mode: The factor is entered manually as a percentage (%) and can be positive (increases consumption) or negative (decreases it). Use it to account for unique conditions not related to weather. For example: poor road conditions, frequent traffic jams, aggressive driving style, or the vehicle's technical condition.
ru: Этот коэффициент корректирует норму расхода топлива. Автоматический режим: При включении этой опции, коэффициент рассчитывается сам на основе актуальных погодных данных (температура, ветер, осадки). Это позволяет точно учесть влияние погоды на расход. Ручной режим: Коэффициент вводится вручную в процентах (%) и может быть положительным (увеличивает расход) или отрицательным (уменьшает). Используйте его для учета уникальных условий, не связанных с погодой. Например: плохое состояние дороги, частые пробки, агрессивный стиль вождения или техническое состояние автомобиля.

# heater_operating_time_tooltip
source: Enter the total operating time of the autonomous cabin heater in hours. The fuel consumed by the heater is calculated separately and added to the main fuel consumption from driving. The consumption rate for the heater is set in the vehicle's settings.
ru: Введите общее время работы автономного отопителя салона в часах. Расход топлива отопителем рассчитывается отдельно и суммируется с основным расходом на движение. Норма расхода для отопителя задается в настройках автомобиля.

# auto_factor_error
source: Failed to get weather data. Manual input is enabled.
ru: Не удалось получить погодные данные. Включен ручной ввод.

# onboarding_title
source: Your Personal Fuel Assistant
ru: Ваш личный топливный ассистент

# onboarding_step1_title
source: Smart Car Management
ru: Умный учет автомобилей

# onboarding_step1_desc
source: Add your vehicles manually or choose from an extensive database with auto-filled consumption rates. All your cars in one convenient list.
ru: Добавляйте свои автомобили вручную или выбирайте из обширной базы данных с автозаполнением норм расхода. Все ваши машины — в одном удобном списке.

# onboarding_step2_title
source: Accurate Calculations
ru: Точные расчеты

# onboarding_step2_desc
source: Use the calculator for precise fuel consumption tracking, considering winter conditions, AC usage, and mountain trips. Heater operation is available for buses.
ru: Используйте калькулятор для точного расчета расхода топлива, учитывая зимние условия, работу кондиционера и поездки в горной местности. Для автобусов доступен учет работы отопителя.

# onboarding_step3_title
source: Analysis & Export
ru: Анализ и экспорт

# onboarding_step3_desc
source: Monitor your statistics with clear charts, view detailed calculation history, and share your data in a convenient format.
ru: Следите за статистикой на наглядных графиках, просматривайте детальную историю расчетов и делитесь данными в удобном формате.

# onboarding_button
source: Get Started
ru: Начать работу

# car_form_step1_title
source: Step 1: Identification
ru: Шаг 1: Идентификация

# car_form_step2_title
source: Step 2: Model Selection (Autocomplete)
ru: Шаг 2: Выбор модели (автозаполнение)

# car_form_step3_title
source: Step 3: Consumption Rates & Details
ru: Шаг 3: Нормы расхода и детали
